cc_菱形继承.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-11-10 二 19:50 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>C++菱形继承小记</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Evan Meek">
<link rel="shortcut icon" href="/images/rose-red.png" type="image/x-icon" />
<link rel="stylesheet" href="/css/animate.min.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">C++菱形继承小记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org39f066a">多继承最明显的问题</a></li>
<li><a href="#orged8be35">解决多继承带来的菱形继承问题</a></li>
<li><a href="#org37a90ae">最后</a></li>
</ul>
</div>
</div>
<p>
最近在复习C++，复习到多继承这个点上，由于多继承用的不多，以防自己以后忘记便有了这篇文章。
</p>

<div id="outline-container-org39f066a" class="outline-2">
<h2 id="org39f066a">多继承最明显的问题</h2>
<div class="outline-text-2" id="text-org39f066a">
<p>
我们直接用代码来说话，下面我们会创建多个类，让它们形成一个 <b><b>菱形继承</b></b> 的关系。
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #CED5DC;">#include</span> <span style="color: #C0C7CE;">&lt;</span><span style="color: #10CFC0;">iostream</span><span style="color: #C0C7CE;">&gt;</span>
<span style="color: #CED5DC;">#include</span> <span style="color: #C0C7CE;">&lt;</span><span style="color: #10CFC0;">string</span><span style="color: #C0C7CE;">&gt;</span>

<span style="color: #CED5DC; text-decoration: underline;">using</span> <span style="color: #CED5DC; text-decoration: underline;">namespace</span> <span style="color: #A5ACB2; text-decoration: underline;">std</span>;

<span style="color: #CED5DC; text-decoration: underline;">class</span> <span style="color: #8DC85F;">A</span>
<span style="color: #C0C7CE;">{</span>
  <span style="color: #8DC85F;">int</span> <span style="color: #31C6FF;">a</span>;
<span style="color: #CED5DC; text-decoration: underline;">public</span>:
  <span style="color: #ECA964;">A</span><span style="color: #31C6FF;">(</span><span style="color: #8DC85F;">int</span> <span style="color: #31C6FF;">out_a</span>=10<span style="color: #31C6FF;">)</span>:<span style="color: #ECA964;">a</span><span style="color: #31C6FF;">(</span>out_a<span style="color: #31C6FF;">){</span>
    cout &lt;&lt; <span style="color: #10CFC0;">"A &#21019;&#24314;"</span> &lt;&lt;endl;
  <span style="color: #31C6FF;">}</span>
<span style="color: #C0C7CE;">}</span>;

<span style="color: #CED5DC; text-decoration: underline;">class</span> <span style="color: #8DC85F;">B</span>: <span style="color: #CED5DC; text-decoration: underline;">public</span> <span style="color: #8DC85F;">A</span>
<span style="color: #C0C7CE;">{</span>
  <span style="color: #8DC85F;">int</span> <span style="color: #31C6FF;">b</span>;
<span style="color: #CED5DC; text-decoration: underline;">public</span>:
  <span style="color: #ECA964;">B</span><span style="color: #31C6FF;">(</span><span style="color: #8DC85F;">int</span> <span style="color: #31C6FF;">out_b</span>=10<span style="color: #31C6FF;">)</span>:<span style="color: #ECA964;">b</span><span style="color: #31C6FF;">(</span>out_b<span style="color: #31C6FF;">){</span>
    cout &lt;&lt; <span style="color: #10CFC0;">"B &#21019;&#24314;"</span> &lt;&lt; endl;
  <span style="color: #31C6FF;">}</span>
<span style="color: #C0C7CE;">}</span>;

<span style="color: #CED5DC; text-decoration: underline;">class</span> <span style="color: #8DC85F;">C</span>: <span style="color: #CED5DC; text-decoration: underline;">public</span> <span style="color: #8DC85F;">A</span>
<span style="color: #C0C7CE;">{</span>
  <span style="color: #8DC85F;">int</span> <span style="color: #31C6FF;">c</span>;
<span style="color: #CED5DC; text-decoration: underline;">public</span>:
  <span style="color: #ECA964;">C</span><span style="color: #31C6FF;">(</span><span style="color: #8DC85F;">int</span> <span style="color: #31C6FF;">out_c</span>=10<span style="color: #31C6FF;">)</span>:<span style="color: #ECA964;">c</span><span style="color: #31C6FF;">(</span>out_c<span style="color: #31C6FF;">){</span>
    cout &lt;&lt; <span style="color: #10CFC0;">"C &#21019;&#24314;"</span> &lt;&lt; endl;
  <span style="color: #31C6FF;">}</span>
<span style="color: #C0C7CE;">}</span>;

<span style="color: #CED5DC; text-decoration: underline;">class</span> <span style="color: #8DC85F;">D</span>: <span style="color: #CED5DC; text-decoration: underline;">public</span> <span style="color: #8DC85F;">B</span>, <span style="color: #CED5DC; text-decoration: underline;">public</span> <span style="color: #8DC85F;">C</span>
<span style="color: #C0C7CE;">{</span>
  <span style="color: #8DC85F;">int</span> <span style="color: #31C6FF;">d</span>;
<span style="color: #CED5DC; text-decoration: underline;">public</span>:
  <span style="color: #ECA964;">D</span><span style="color: #31C6FF;">(</span><span style="color: #8DC85F;">int</span> <span style="color: #31C6FF;">out_d</span>=10<span style="color: #31C6FF;">)</span>:<span style="color: #ECA964;">d</span><span style="color: #31C6FF;">(</span>out_d<span style="color: #31C6FF;">){</span>
    cout &lt;&lt; <span style="color: #10CFC0;">"D &#21019;&#24314;"</span> &lt;&lt; endl;
  <span style="color: #31C6FF;">}</span>
<span style="color: #C0C7CE;">}</span>;


<span style="color: #8DC85F;">int</span> <span style="color: #ECA964;">main</span><span style="color: #C0C7CE;">()</span>
<span style="color: #C0C7CE;">{</span>
  <span style="color: #8DC85F;">D</span> <span style="color: #31C6FF;">d</span>;
<span style="color: #C0C7CE;">}</span>

</pre>
</div>

<p>
这边用文字简单描述下它们的关系，首先有个基类 <b><b>A</b></b> ，然后有两个由 <b><b>A</b></b> 派生类 <b><b>B</b></b> 和 <b><b>C</b></b> ，然后有一个由类 <b><b>B</b></b> 和类 <b><b>C</b></b> 派生的类 <b><b>D</b></b> 。
</p>

<p>
这就是 <b><b>菱形继承</b></b> 了，其运行结果如下:
</p>

<div class="org-src-container">
<pre class="src src-shell">A &#21019;&#24314;
B &#21019;&#24314;
A &#21019;&#24314;
C &#21019;&#24314;
D &#21019;&#24314;
</pre>
</div>

<p>
我们发现，其中 <b><b>A</b></b> 类的构造函数被执行了两次，这就是因为 <b><b>D</b></b> 两个基类都继承于类 <b><b>A</b></b> 所以就会造成这样的问题啦
</p>
</div>
</div>

<div id="outline-container-orged8be35" class="outline-2">
<h2 id="orged8be35">解决多继承带来的菱形继承问题</h2>
<div class="outline-text-2" id="text-orged8be35">
<p>
那么要如何解决呢？其实也很简单，只需要将 <b><b>D</b></b> 类的两个父类所继承的位置添加一个 <b><b>virtual</b></b> 关键字就可以解决这个问题。
</p>

<p>
就像这样:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #CED5DC;">#include</span> <span style="color: #C0C7CE;">&lt;</span><span style="color: #10CFC0;">iostream</span><span style="color: #C0C7CE;">&gt;</span>
<span style="color: #CED5DC;">#include</span> <span style="color: #C0C7CE;">&lt;</span><span style="color: #10CFC0;">string</span><span style="color: #C0C7CE;">&gt;</span>

<span style="color: #CED5DC; text-decoration: underline;">using</span> <span style="color: #CED5DC; text-decoration: underline;">namespace</span> <span style="color: #A5ACB2; text-decoration: underline;">std</span>;

<span style="color: #CED5DC; text-decoration: underline;">class</span> <span style="color: #8DC85F;">A</span>
<span style="color: #C0C7CE;">{</span>
  <span style="color: #8DC85F;">int</span> <span style="color: #31C6FF;">a</span>;
<span style="color: #CED5DC; text-decoration: underline;">public</span>:
  <span style="color: #ECA964;">A</span><span style="color: #31C6FF;">(</span><span style="color: #8DC85F;">int</span> <span style="color: #31C6FF;">out_a</span>=10<span style="color: #31C6FF;">)</span>:<span style="color: #ECA964;">a</span><span style="color: #31C6FF;">(</span>out_a<span style="color: #31C6FF;">){</span>
    cout &lt;&lt; <span style="color: #10CFC0;">"A &#21019;&#24314;"</span> &lt;&lt;endl;
  <span style="color: #31C6FF;">}</span>
<span style="color: #C0C7CE;">}</span>;

<span style="color: #CED5DC; text-decoration: underline;">class</span> <span style="color: #8DC85F;">B</span>: <span style="color: #CED5DC; text-decoration: underline;">virtual</span> <span style="color: #CED5DC; text-decoration: underline;">public</span> <span style="color: #8DC85F;">A</span>
<span style="color: #C0C7CE;">{</span>
  <span style="color: #8DC85F;">int</span> <span style="color: #31C6FF;">b</span>;
<span style="color: #CED5DC; text-decoration: underline;">public</span>:
  <span style="color: #ECA964;">B</span><span style="color: #31C6FF;">(</span><span style="color: #8DC85F;">int</span> <span style="color: #31C6FF;">out_b</span>=10<span style="color: #31C6FF;">)</span>:<span style="color: #ECA964;">b</span><span style="color: #31C6FF;">(</span>out_b<span style="color: #31C6FF;">){</span>
    cout &lt;&lt; <span style="color: #10CFC0;">"B &#21019;&#24314;"</span> &lt;&lt; endl;
  <span style="color: #31C6FF;">}</span>
<span style="color: #C0C7CE;">}</span>;

<span style="color: #CED5DC; text-decoration: underline;">class</span> <span style="color: #8DC85F;">C</span>: <span style="color: #CED5DC; text-decoration: underline;">virtual</span> <span style="color: #CED5DC; text-decoration: underline;">public</span> <span style="color: #8DC85F;">A</span>
<span style="color: #C0C7CE;">{</span>
  <span style="color: #8DC85F;">int</span> <span style="color: #31C6FF;">c</span>;
<span style="color: #CED5DC; text-decoration: underline;">public</span>:
  <span style="color: #ECA964;">C</span><span style="color: #31C6FF;">(</span><span style="color: #8DC85F;">int</span> <span style="color: #31C6FF;">out_c</span>=10<span style="color: #31C6FF;">)</span>:<span style="color: #ECA964;">c</span><span style="color: #31C6FF;">(</span>out_c<span style="color: #31C6FF;">){</span>
    cout &lt;&lt; <span style="color: #10CFC0;">"C &#21019;&#24314;"</span> &lt;&lt; endl;
  <span style="color: #31C6FF;">}</span>
<span style="color: #C0C7CE;">}</span>;

<span style="color: #CED5DC; text-decoration: underline;">class</span> <span style="color: #8DC85F;">D</span>: <span style="color: #CED5DC; text-decoration: underline;">public</span> <span style="color: #8DC85F;">B</span>, <span style="color: #CED5DC; text-decoration: underline;">public</span> <span style="color: #8DC85F;">C</span>
<span style="color: #C0C7CE;">{</span>
  <span style="color: #8DC85F;">int</span> <span style="color: #31C6FF;">d</span>;
<span style="color: #CED5DC; text-decoration: underline;">public</span>:
  <span style="color: #ECA964;">D</span><span style="color: #31C6FF;">(</span><span style="color: #8DC85F;">int</span> <span style="color: #31C6FF;">out_d</span>=10<span style="color: #31C6FF;">)</span>:<span style="color: #ECA964;">d</span><span style="color: #31C6FF;">(</span>out_d<span style="color: #31C6FF;">){</span>
    cout &lt;&lt; <span style="color: #10CFC0;">"D &#21019;&#24314;"</span> &lt;&lt; endl;
  <span style="color: #31C6FF;">}</span>
<span style="color: #C0C7CE;">}</span>;


<span style="color: #8DC85F;">int</span> <span style="color: #ECA964;">main</span><span style="color: #C0C7CE;">()</span>
<span style="color: #C0C7CE;">{</span>
  <span style="color: #8DC85F;">D</span> <span style="color: #31C6FF;">d</span>;
<span style="color: #C0C7CE;">}</span>
</pre>
</div>

<p>
其运行结果如下:
</p>

<div class="org-src-container">
<pre class="src src-shell">A &#21019;&#24314;
B &#21019;&#24314;
C &#21019;&#24314;
D &#21019;&#24314;
</pre>
</div>

<p>
我们发现 <b><b>A</b></b> 类的构造函数只被执行了一次，也就解决这个问题啦。
</p>
</div>
</div>

<div id="outline-container-org37a90ae" class="outline-2">
<h2 id="org37a90ae">最后</h2>
<div class="outline-text-2" id="text-org37a90ae">
<p>
最后由于我现在写C++代码也不多，所以也不知道这个多继承的应用场景，可能是想更方便进行代码复用和提高执行效率吧。。
</p>

<p>
不过感觉这样有些得不偿失，会让程序变得复杂不少。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-07-16 四 00:00</p>
<p class="author">Author: Evan Meek</p>
<p class="date">Created: 2020-11-10 二 19:50</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
